Телеграмм бот на основе библиотеки aiogramm
Идея функционала была в том чтобы разработать шаблон бота в который можно было бы подставлять любые вопросы в файлах формата ".txt" 

В данный момент бот умеет читать файлы .txt и создавать на основе этого словарь вопросов с ключем - номером вопроса, и значением - самим вопросом.
После чего эти словари считываются в хэндлерах по нумерации и отправляются пользователю их значение.

Психологический тест определения темперамента по формуле Белова
Собираются положительные ответы на вопросы и процентном соотношении... исходя чего формируется результат
 (количество "+" по одному типу темперамента разделить на
количество "+" по всем четырем типам темперамента и умножить на 100%).
В окончательном виде ваша формула темперамента примет примерно такой вид:
Т = 36%Х + 35% С + 15% Ф + 14%М, что означает, что ваш темперамент на 36%
холерический, на 35% сангвинический, на 15% флегматический и на 14%
меланхолический.




